In [4]:
import pandas as pd
Dt =pd.read_excel('Groups.xlsx')
Dt

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [5]:
Dt.head()

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26

In [6]:
Dt.head(2)

   Group A  Group B  Group C
0       23       19       14
1       21       21       13

In [7]:
Dt.tail(3)

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21

In [8]:
Dt.shape

(7, 3)

In [9]:
Dt.columns

Index(['Group A', 'Group B', 'Group C'], dtype='object')

In [10]:
Dt.dtypes

Group A    int64
Group B    int64
Group C    int64
dtype: object

In [11]:
Dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Group A  7 non-null      int64
 1   Group B  7 non-null      int64
 2   Group C  7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [13]:
Dt['Group A']

0    23
1    21
2    19
3    23
4    23
5    22
6    26
Name: Group A, dtype: int64

In [14]:
Dt[['Group A']]

   Group A
0       23
1       21
2       19
3       23
4       23
5       22
6       26

In [15]:
Dt.sample(2)

   Group A  Group B  Group C
4       23       28       26
5       22       30       29

In [16]:
  Dt.sample(2)

   Group A  Group B  Group C
3       23       29       23
4       23       28       26

In [17]:
Dt.sample(3)

   Group A  Group B  Group C
6       26       24       21
0       23       19       14
5       22       30       29

In [18]:
Dt[['Group A']].head(3)

   Group A
0       23
1       21
2       19

In [19]:
Dt[['Group A']].head(2)

   Group A
0       23
1       21

In [20]:
Dt[['Group A']].tail(2)

   Group A
5       22
6       26

In [21]:
Dt[2:7]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [22]:
Dt[2:5]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26

In [23]:
Dt[-2:]

   Group A  Group B  Group C
5       22       30       29
6       26       24       21

In [24]:
Dt[-3:]

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21